{"/guides/kali-linux/initial-setup/":{"data":{"":"","common-steps#Common Steps":" Download the Kali Linux installer from the official Kali website. Use Balena Etcher to create a bootable USB install drive. Plug the USB drive into the system and boot from it. This step may need BIOS changes. (e.g. secure boot disabling, legacy mode activation) Complete the installation as desired. Login using the user account. Open a Terminal Emulator. Note the IP address:\nifconfig Enable the SSH server service:\nsudo systemctl enable ssh Perform a full system update - this will take a while:\nsudo apt update \u0026\u0026 sudo apt full-upgrade Reboot the system:\nsudo reboot ","headless-installation-rpi#Headless Installation (RPi)":"For a headless installation, and to have the system connect to a WiFi network automatically, add a wpa_supplicant.conf file to the first partition of the USB drive.\nGenerate the file using the following command on a different Linux system:\nwpa_passphrase YOURNETWORK \u003e wpa_supplicant.conf\nCaution\nYour user’s shell history will now contain your WiFi network password, edit your shell’s history file to remove it. (e.g. ~/.zsh_history, ~/.bash_history)","ssh#SSH":"Password Authentication\rCaution\nThis is not a recommended method of authentication, especially if your system is connected to the Internet. You should use SSH keys.\nEdit the configuration file as a superuser:\nsudo nano /etc/ssh/sshd_config Uncomment the line:\nPasswordAuthentication yes Restart the SSH server:\nsudo systemctl restart ssh You may now logout, and remote into the system. For Windows, I recommend MobaXterm or PuTTY. Key-based Authentication\rTo be confirmed."},"title":"Initial Setup"},"/tips/vs-xaml-unpackaged-comexception-classnotreg/":{"data":{"":"Building an unpackaged blank WinUI 3 project, the following exception is thrown:\nSystem.Runtime.InteropServices.COMException: ‘Class not registered (0x80040154 (REGDB_E_CLASSNOTREG))’\nTo fix this, add the following in the in the project’s .csproj:\n\u003cPropertyGroup\u003e ... \u003cWindowsPackageType\u003eNone\u003c/WindowsPackageType\u003e ... \u003c/PropertyGroup\u003e"},"title":"Visual Studio XAML COMException CLASSNOTREG"}}