{"/guides/kali-linux/alfa-awus036ach/":{"data":{"":"","driver-installation#Driver Installation":"\rNote\nI prefer to use the morrownr’s driver since it’s a community-driven project.\nInstall the DKMS and Kernel headers package:\nsudo apt-get install dkms linux-headers-$(uname -r) bc Clone the repository:\ngit clone https://github.com/morrownr/8812au-20210820.git Change to the cloned directory:\ncd 8812au-20210820 Install the driver:\nsudo make dkms_install Run the installation script as a superuser - follow the instructions:\nsudo ./install-driver.sh ","references#References":" Alfa’s RTL8812AU Support Page morrownr’s Driver aircrack-ng’s Driver "},"title":"Alfa AWUS036ACH"},"/guides/kali-linux/gps-configuration/":{"data":{"":"","required-packages#Required Packages":"\rNote\nI install extra packages that offer tools I usually end up eventually using for troubleshooting or during development.\nInstall required packages:\nsudo apt install gpsd gpsd-clients gpsd-tools ","usb-dongles#USB Dongles":"BU-353N\rGlobalSat BU-353N Product Page Edit the gpsd configuration file:\nsudo nano /etc/default/gpsd Add the following gpsd options:\nGPSD_OPTIONS=\"-b -n\" Note\nThese mandatory switches were identified by the wardriving community for the BU-353N to work properly. They enable read-only mode, and tell gpsd not to wait for a client before polling the GPS device.\nuBlox 7\rlsusb = 1546:01a7 U-Blox AG [u-blox 7] ls /dev = /dev/ttyACM# gpsd udev rules creates /dev/gps# BU-353S4\rGlobalSat BU-353S4 EOL Notice lsusb = 067b:2303 Prolific Technology, Inc. PL2303 Serial Port ls /dev = /dev/ttyUSB# Plug and play! "},"title":"GPS Configuration"},"/guides/kali-linux/initial-setup/":{"data":{"":"","common-steps#Common Steps":" Download the Kali Linux installer from the official Kali website. Use Balena Etcher to create a bootable USB install drive. Plug the USB drive into the system and boot from it. This step may need BIOS changes. (e.g. secure boot disabling, legacy mode activation) Complete the installation as desired. Login using the user account. Open a Terminal Emulator. Note the IP address:\nifconfig Enable the SSH server service:\nsudo systemctl enable ssh Perform a full system update - this will take a while:\nsudo apt update \u0026\u0026 sudo apt full-upgrade Reboot the system:\nsudo reboot ","headless-installation-rpi#Headless Installation (RPi)":"For a headless installation, and to have the system connect to a WiFi network automatically, add a wpa_supplicant.conf file to the first partition of the USB drive.\nGenerate the file using the following command on a different Linux system:\nwpa_passphrase YOURNETWORK \u003e wpa_supplicant.conf\nCaution\nYour user’s shell history will now contain your WiFi network password, edit your shell’s history file to remove it. (e.g. ~/.zsh_history, ~/.bash_history)","ssh#SSH":"Password Authentication\rCaution\nThis is not a recommended method of authentication, especially if your system is connected to the Internet. You should use SSH keys.\nEdit the configuration file as a superuser:\nsudo nano /etc/ssh/sshd_config Uncomment the line:\nPasswordAuthentication yes Restart the SSH server:\nsudo systemctl restart ssh You may now logout, and remote into the system. For Windows, I recommend MobaXterm or PuTTY. Key-based Authentication\rTo be confirmed."},"title":"Initial Setup"},"/tips/enabling-wlan-monitor-mode/":{"data":{"":"Not much else to say, for some reason my brain hasn’t saved these commands.\nsudo ip link set wlan# down sudo iw dev wlan# set type monitor sudo ip link set wlan# up"},"title":"Enabling WLAN Monitor Mode"},"/tips/vs-xaml-unpackaged-comexception-classnotreg/":{"data":{"":"Building an unpackaged blank WinUI 3 project, the following exception is thrown:\nSystem.Runtime.InteropServices.COMException: ‘Class not registered (0x80040154 (REGDB_E_CLASSNOTREG))’\nTo fix this, add the following in the in the project’s .csproj:\n\u003cPropertyGroup\u003e ... \u003cWindowsPackageType\u003eNone\u003c/WindowsPackageType\u003e ... \u003c/PropertyGroup\u003e"},"title":"Visual Studio XAML COMException CLASSNOTREG"}}